<script lang="ts">
	export let width: string = '22.04';
	export let height: string = '22.04';
</script>

<svg
	id="_Слой_2"
	data-name="Слой 2"
	xmlns="http://www.w3.org/2000/svg"
	{width}
	{height}
	viewBox="0 0 22.04 22.04"
>
	<g id="_В_корзину" data-name="В корзину">
		<path
			id="_Закрыть"
			data-name="Закрыть"
			d="m20.98,22.04c-.27,0-.54-.1-.75-.31L.31,1.81C-.1,1.4-.1.73.31.31.73-.1,1.4-.1,1.82.31l19.92,19.92c.42.42.42,1.09,0,1.5-.21.21-.48.31-.75.31Zm-19.16-.31L21.73,1.81c.42-.42.42-1.09,0-1.5-.42-.42-1.09-.42-1.5,0L.31,20.23c-.42.42-.42,1.09,0,1.5.21.21.48.31.75.31s.54-.1.75-.31Z"
		/>
	</g>
</svg>

<style></style>
