<script lang="ts">
  export let width: string = "39.45";
  export let height: string = "26.09";
</script>

<svg id="_Слой_2" data-name="Слой 2" xmlns="http://www.w3.org/2000/svg" {width} {height} viewBox="0 0 39.45 26.09">
	<defs>
		<style>
			.cls-1 {
				fill: #c00;
			}
		</style>
	</defs>
	<g id="_Иконки_неактивные" data-name="Иконки неактивные">
		<g id="_МБ" data-name="МБ">
			<path
				id="_Мб"
				data-name="Мб"
				class="cls-1"
				d="m20.92.02v26.08h-5.93V8.49s-2.37,17.6-2.37,17.6h-4.2l-2.49-17.2v17.2H0V.02h8.77c.26,1.57.53,3.41.81,5.54l.96,6.63L12.1.02h8.82Zm18.52,19.97c0,1.94-.25,3.34-.76,4.19-.51.85-1.27,1.38-2.3,1.59-1.03.22-2.66.32-4.91.32h-7.84V0h13.29v4.53h-6.49v4.41h1.05c2.09,0,3.68.12,4.75.37s1.88.79,2.41,1.64c.53.84.8,2.17.8,3.97v5.07Zm-6.8-.79v-3.77c0-1.1-.11-1.76-.33-2s-.85-.37-1.88-.4v8.57c.86,0,1.44-.11,1.75-.33.31-.22.46-.91.46-2.07Z"
			/>
		</g>
	</g>
</svg>

<style></style>
