<script lang="ts">
  export let width: string = "39.49";
  export let height: string = "32.72";
</script>

<svg id="_Слой_2" data-name="Слой 2" xmlns="http://www.w3.org/2000/svg" {width} {height} viewBox="0 0 39.49 32.72">
	<defs>
		<style>
			.cls-1 {
				fill: #c00;
			}
		</style>
	</defs>
	<g id="_Иконки_неактивные" data-name="Иконки неактивные">
		<g id="_Телега" data-name="Телега">
			<path
				id="_Телега-2"
				data-name="Телега"
				class="cls-1"
				d="m2.7,14.11c10.6-4.6,17.66-7.66,21.2-9.15C33.99.76,36.11.03,37.47,0c.3,0,.97.06,1.42.42.36.3.45.7.51,1,.06.3.12.94.06,1.42-.55,5.75-2.91,19.71-4.12,26.13-.51,2.73-1.51,3.63-2.48,3.72-2.12.18-3.72-1.39-5.75-2.73-3.21-2.09-5-3.39-8.12-5.45-3.6-2.36-1.27-3.66.79-5.78.55-.55,9.84-9.02,10.02-9.78.03-.09.03-.45-.18-.64s-.51-.12-.76-.06c-.33.06-5.42,3.45-15.32,10.14-1.45,1-2.76,1.48-3.94,1.45-1.3-.03-3.79-.73-5.66-1.33C1.67,17.81-.14,17.41,0,16.14c.09-.67,1-1.33,2.7-2.03Z"
			/>
		</g>
	</g>
</svg>

<style></style>
