<script lang="ts">
	export let width: string = '23.22';
	export let height: string = '23.22';
</script>

<svg
	id="_Слой_2"
	data-name="Слой 2"
	xmlns="http://www.w3.org/2000/svg"
	{width}
	{height}
	viewBox="0 0 23.22 23.22"
>
	<g id="_Футболка" data-name="Футболка">
		<g id="_Футболка_неактивнай" data-name="Футболка неактивнай">
			<path
				id="_Крестик"
				data-name="Крестик"
				d="m19.71.6l-8.1,8.1L3.51.6C2.71-.2,1.41-.2.6.6s-.8,2.11,0,2.91l8.1,8.1L.6,19.71c-.8.8-.8,2.11,0,2.91s2.11.8,2.91,0l8.1-8.1,8.1,8.1c.8.8,2.11.8,2.91,0,.8-.8.8-2.11,0-2.91l-8.1-8.1L22.62,3.51c.8-.8.8-2.11,0-2.91-.8-.8-2.11-.8-2.91,0Z"
			/>
		</g>
	</g>
</svg>

<style></style>
